---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData
source: html/96305a10-7b43-a077-1f99-711904814e94.htm
---
# ElectricalLoadAreaData Methods

Creates electrical load areas on all the empty plan circuits of the given level.